station_name = [""] * 32

distance_between_stations = [
    [0, 156, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
     -1, -1],
    [156, 0, 92, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 104, -1, -1, -1, -1, -1, -1, -1, -1,
     -1, -1, -1],
    [-1, 92, 0, 106, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
     -1, -1],
    [-1, -1, 106, 0, 92, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
     -1, -1],
    [-1, -1, -1, 92, 0, 111, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
     -1, -1],
    [-1, -1, -1, -1, 111, 0, 372, -1, -1, -1, -1, 228, 92, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
     -1, -1, -1],
    [-1, -1, -1, -1, -1, 372, 0, 116, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
     -1, -1, 110],
    [-1, -1, -1, -1, -1, -1, 116, 0, 134, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
     -1, -1, -1],
    [-1, -1, -1, -1, -1, -1, -1, 134, 0, 96, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
     -1, -1],
    [-1, -1, -1, -1, -1, -1, -1, -1, 96, 0, 141, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
     269, -1],
    [-1, -1, -1, -1, -1, -1, -1, -1, -1, 141, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
     -1, -1],
    [-1, -1, -1, -1, -1, 228, -1, -1, -1, -1, -1, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
     -1, -1],
    [-1, -1, -1, -1, -1, 92, -1, -1, -1, -1, -1, -1, 0, 92, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
     -1, -1],
    [-1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 92, 0, 121, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
     -1, -1],
    [-1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 121, 0, 94, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
     -1, -1],
    [-1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 94, 0, 100, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
     -1, -1],
    [-1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 100, 0, 80, -1, -1, -1, -1, -1, 114, 127, -1, -1, -1,
     -1, -1, -1],
    [-1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 80, 0, 86, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
     -1, -1],
    [-1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 86, 0, -1, -1, -1, -1, -1, -1, -1, 304, -1, -1,
     -1, -1],
    [-1, 104, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 0, 140, -1, -1, -1, -1, -1, -1, -1,
     -1, -1, -1],
    [-1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 140, 0, 120, -1, -1, -1, -1, -1, -1,
     -1, -1, -1],
    [-1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 120, 0, 104, -1, -1, -1, -1, -1,
     -1, -1, -1],
    [-1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 104, 0, 107, -1, -1, -1, -1,
     -1, -1, -1],
    [-1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 114, -1, -1, -1, -1, -1, 107, 0, -1, -1, -1, -1,
     -1, -1, -1],
    [-1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 127, -1, -1, -1, -1, -1, -1, -1, 0, 222, -1, -1,
     -1, -1, -1],
    [-1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 222, 0, 106, 136,
     -1, -1, -1],
    [-1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 304, -1, -1, -1, -1, -1, -1, 106, 0, -1,
     -1, -1, -1],
    [-1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 136, -1, 0,
     107, -1, -1],
    [-1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 107, 0,
     192, -1],
    [-1, -1, -1, -1, -1, -1, -1, -1, -1, 269, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
     192, 0, 100],
    [-1, -1, -1, -1, -1, -1, 110, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
     -1, 100, 0]]

station_name[1] = "Сормовская"
station_name[2] = "Спортивная"
station_name[3] = "Калининская"
station_name[4] = "Куйбышевская"
station_name[5] = "Канавинская"
station_name[6] = "Московская"
station_name[7] = "Горьковская"
station_name[8] = "Свердловская"
station_name[9] = "Площать Свободы"
station_name[10] = "Республиканская"
station_name[11] = "Советская"
station_name[12] = "Мещерская"
station_name[13] = "Чкаловская"
station_name[14] = "Ленинская"
station_name[15] = "Заречная"
station_name[16] = "Двигатель Революции"
station_name[17] = "Пролетарская"
station_name[18] = "Северная"
station_name[19] = "Комсомольская"
station_name[20] = "Красные Зори"
station_name[21] = "Индустриальная"
station_name[22] = "Первомайская"
station_name[23] = "Дзержинская"
station_name[24] = "Магистральная"
station_name[25] = "Бауманская"
station_name[26] = "Сельхозинститут"
station_name[27] = "Щербинская"
station_name[28] = "Мыза"
station_name[29] = "Приокская"
station_name[30] = "Дворец Спорта"
station_name[31] = "Университет"


def put_stations_name(canvas):
    canvas.create_text(105, 13, text="Сормовская",
                       font="fangsongti  14")
    canvas.create_text(220, 110, text="Спортивная",
                       font="fangsongti  14")
    canvas.create_text(290, 180, text="Калининская",
                       font="fangsongti  14")
    canvas.create_text(350, 240, text="Куйбышевская",
                       font="fangsongti  14")
    canvas.create_text(360, 360, text="Канавинская",
                       font="fangsongti  14")
    canvas.create_text(530, 310, text="Московская",
                       font="fangsongti  14")
    canvas.create_text(700, 330, text="Горьковская",
                       font="fangsongti  14")
    canvas.create_text(810, 270, text="Свердловская",
                       font="fangsongti  14")
    canvas.create_text(1000, 350, text="Площадь\nСвободы",
                       font="fangsongti  14", justify="left")
    canvas.create_text(870, 440, text="Республиканская",
                       font="fangsongti  14")
    canvas.create_text(1000, 566, text="Советская",
                       font="fangsongti  14")
    canvas.create_text(485, 196, text="Мещерская",
                       font="fangsongti  14")
    canvas.create_text(520, 440, text="Чкаловская",
                       font="fangsongti  14")
    canvas.create_text(490, 535, text="Ленинская",
                       font="fangsongti  14")
    canvas.create_text(465, 615, text="Заречная",
                       font="fangsongti  14")
    canvas.create_text(430, 690, text="  Двигатель \n Революции",
                       font="fangsongti  14")
    canvas.create_text(390, 760, text="Пролетарская",
                       font="fangsongti  14")
    canvas.create_text(205, 820, text="Северная",
                       font="fangsongti  14")
    canvas.create_text(125, 895, text="Комсомольская",
                       font="fangsongti  14")
    canvas.create_text(189, 240, text="Красные \n Зори",
                       font="fangsongti  14")
    canvas.create_text(230, 390, text="Индустриальная",
                       font="fangsongti  14")
    canvas.create_text(230, 490, text="Первомайская",
                       font="fangsongti  14")
    canvas.create_text(260, 590, text="Дзержинская",
                       font="fangsongti  14")
    canvas.create_text(280, 655, text="Магистральная",
                       font="fangsongti  14")
    canvas.create_text(460, 825, text="Бауманская",
                       font="fangsongti  14")
    canvas.create_text(720, 890, text="Сельхозинститут",
                       font="fangsongti  14")
    canvas.create_text(620, 970, text="Щербинская",
                       font="fangsongti  14")
    canvas.create_text(705, 790, text="Мыза",
                       font="fangsongti  14")
    canvas.create_text(765, 680, text="Приокское",
                       font="fangsongti  14")
    canvas.create_text(785, 610, text="Дворец \n спорта",
                       font="fangsongti  14")
    canvas.create_text(795, 490, text="Университет",
                       font="fangsongti  14")
